#### Terraform Apply 🎬`success`

<details><summary>Show Result</summary>

```

terraform
data.aws_resourcegroupstaggingapi_resources.alb: Reading...
data.aws_resourcegroupstaggingapi_resources.ecs_cluster: Reading...
data.aws_vpc.vpc: Reading...
aws_ecr_repository.app_repo: Refreshing state... [id=demo-fargate-app]
data.aws_security_group.ecs: Reading...
data.aws_resourcegroupstaggingapi_resources.alb: Read complete after 0s [id=aws]
data.aws_resourcegroupstaggingapi_resources.ecs_cluster: Read complete after 0s [id=aws]
data.aws_lb_listener.alb_listener: Reading...
data.aws_security_group.ecs: Read complete after 1s [id=sg-0abc9927f6f2f7abd]
data.aws_lb_listener.alb_listener: Read complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:listener/app/demo-alb/8a9eeb265d836dbe/02c783ce0a62a09c]
data.aws_vpc.vpc: Read complete after 1s [id=vpc-09588034d45d4bae9]
data.aws_subnets.subnets: Reading...
data.aws_subnets.subnets: Read complete after 0s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.log_group will be created
  + resource "aws_cloudwatch_log_group" "log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "demo-fargate-app-logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_codedeploy_app.codedeploy_app will be created
  + resource "aws_codedeploy_app" "codedeploy_app" {
      + application_id      = (known after apply)
      + arn                 = (known after apply)
      + compute_platform    = "ECS"
      + github_account_name = (known after apply)
      + id                  = (known after apply)
      + linked_to_github    = (known after apply)
      + name                = "demo-fargate-app"
      + tags_all            = (known after apply)
    }

  # aws_codedeploy_deployment_group.app_deployment_group will be created
  + resource "aws_codedeploy_deployment_group" "app_deployment_group" {
      + app_name               = "demo-fargate-app"
      + arn                    = (known after apply)
      + compute_platform       = (known after apply)
      + deployment_config_name = "CodeDeployDefault.ECSAllAtOnce"
      + deployment_group_id    = (known after apply)
      + deployment_group_name  = "demo-fargate-app-deploymentGroup"
      + id                     = (known after apply)
      + service_role_arn       = (known after apply)
      + tags_all               = (known after apply)

      + auto_rollback_configuration {
          + enabled = true
          + events  = [
              + "DEPLOYMENT_FAILURE",
            ]
        }

      + blue_green_deployment_config {
          + deployment_ready_option {
              + action_on_timeout = "CONTINUE_DEPLOYMENT"
            }

          + green_fleet_provisioning_option {
              + action = (known after apply)
            }

          + terminate_blue_instances_on_deployment_success {
              + action                           = "TERMINATE"
              + termination_wait_time_in_minutes = 5
            }
        }

      + deployment_style {
          + deployment_option = "WITH_TRAFFIC_CONTROL"
          + deployment_type   = "BLUE_GREEN"
        }

      + ecs_service {
          + cluster_name = "ecs-fargate"
          + service_name = "demo-fargate-app"
        }

      + load_balancer_info {

          + target_group_pair_info {
              + prod_traffic_route {
                  + listener_arns = [
                      + "arn:aws:elasticloadbalancing:us-east-1:369168831564:listener/app/demo-alb/8a9eeb265d836dbe/02c783ce0a62a09c",
                    ]
                }

              + target_group {
                  + name = "demo-fargate-app-bluegreen1"
                }
              + target_group {
                  + name = "demo-fargate-app-bluegreen2"
                }
            }
        }
    }

  # aws_ecr_lifecycle_policy.repo_policy will be created
  + resource "aws_ecr_lifecycle_policy" "repo_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "demo-fargate-app"
    }

  # aws_ecs_service.service will be created
  + resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:us-east-1:369168831564:cluster/ecs-fargate"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "demo-fargate-app"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_controller {
          + type = "CODE_DEPLOY"
        }

      + load_balancer {
          + container_name   = "demo-fargate-app"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0abc9927f6f2f7abd",
            ]
          + subnets          = [
              + "subnet-05bbd722c95dce46e",
              + "subnet-069f38a28c0fd50b1",
              + "subnet-0e744c5ae26360bdc",
            ]
        }
    }

  # aws_ecs_task_definition.task_def will be created
  + resource "aws_ecs_task_definition" "task_def" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "demo-fargate-app"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "environment" = "dev"
          + "project"     = "demo"
        }
      + tags_all                 = {
          + "environment" = "dev"
          + "project"     = "demo"
        }
      + task_role_arn            = (known after apply)
    }

  # aws_iam_policy.codedeploy_policy will be created
  + resource "aws_iam_policy" "codedeploy_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "demo-fargate-app-codeDeployPolicy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecs:DescribeServices",
                          + "ecs:CreateTaskSet",
                          + "ecs:UpdateServicePrimaryTaskSet",
                          + "ecs:DeleteTaskSet",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:ModifyRule",
                          + "lambda:InvokeFunction",
                          + "cloudwatch:DescribeAlarms",
                          + "sns:Publish",
                          + "s3:GetObject",
                          + "s3:GetObjectVersion",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "iam:PassRole",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "iam:PassedToService" = [
                                  + "ecs-tasks.amazonaws.com",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.codedeploy_role will be created
  + resource "aws_iam_role" "codedeploy_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codedeploy.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo-fargate-app-codeDeployRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.ecs_task_execution_role will be created
  + resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo-fargate-app-ecsTaskExecutionRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.ecs_task_role will be created
  + resource "aws_iam_role" "ecs_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo-fargate-app-ecsTaskRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.codedeploy_role_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "codedeploy_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "demo-fargate-app-codeDeployRole"
    }

  # aws_iam_role_policy_attachment.ecs_task_execution_role_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "demo-fargate-app-ecsTaskExecutionRole"
    }

  # aws_lb_listener_rule.listener_rule will be created
  + resource "aws_lb_listener_rule" "listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:us-east-1:369168831564:listener/app/demo-alb/8a9eeb265d836dbe/02c783ce0a62a09c"
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {

          + path_pattern {
              + values = [
                  + "/",
                ]
            }
        }
    }

  # aws_lb_target_group.bluegreen1 will be created
  + resource "aws_lb_target_group" "bluegreen1" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "demo-fargate-app-bluegreen1"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-09588034d45d4bae9"

      + health_check {
          + enabled             = (known after apply)
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # aws_lb_target_group.bluegreen2 will be created
  + resource "aws_lb_target_group" "bluegreen2" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "demo-fargate-app-bluegreen2"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-09588034d45d4bae9"

      + health_check {
          + enabled             = (known after apply)
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # local_file.appspec will be created
  + resource "local_file" "appspec" {
      + content              = <<-EOT
            Resources:
              - TargetService:
                  Type: AWS::ECS::Service
                  Properties:
                    TaskDefinition: <TASK_DEFINITION>
                    LoadBalancerInfo:
                      ContainerName: demo-fargate-app
                      ContainerPort: 8080
        EOT
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../appspec.yaml"
      + id                   = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.
local_file.appspec: Creating...
local_file.appspec: Creation complete after 0s [id=1dbb9c90d303cbcfe69db59b8fd829bae08b9b25]
aws_cloudwatch_log_group.log_group: Creating...
aws_codedeploy_app.codedeploy_app: Creating...
aws_iam_role.codedeploy_role: Creating...
aws_ecr_lifecycle_policy.repo_policy: Creating...
aws_iam_role.ecs_task_role: Creating...
aws_lb_target_group.bluegreen1: Creating...
aws_iam_policy.codedeploy_policy: Creating...
aws_lb_target_group.bluegreen2: Creating...
aws_iam_role.ecs_task_execution_role: Creating...
aws_ecr_lifecycle_policy.repo_policy: Creation complete after 0s [id=demo-fargate-app]
aws_cloudwatch_log_group.log_group: Creation complete after 1s [id=demo-fargate-app-logs]
aws_iam_policy.codedeploy_policy: Creation complete after 1s [id=arn:aws:iam::369168831564:policy/demo-fargate-app-codeDeployPolicy]
aws_codedeploy_app.codedeploy_app: Creation complete after 1s [id=fa5a4ffa-bc0f-421b-beff-4b06c9d8a3f3:demo-fargate-app]
aws_lb_target_group.bluegreen2: Creation complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:targetgroup/demo-fargate-app-bluegreen2/cd98953603b3c5bf]
aws_lb_target_group.bluegreen1: Creation complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:targetgroup/demo-fargate-app-bluegreen1/f7c78107b7f3f192]
aws_lb_listener_rule.listener_rule: Creating...
aws_iam_role.ecs_task_execution_role: Creation complete after 1s [id=demo-fargate-app-ecsTaskExecutionRole]
aws_iam_role_policy_attachment.ecs_task_execution_role_policy_attachment: Creating...
aws_iam_role.ecs_task_role: Creation complete after 1s [id=demo-fargate-app-ecsTaskRole]
aws_iam_role.codedeploy_role: Creation complete after 1s [id=demo-fargate-app-codeDeployRole]
aws_iam_role_policy_attachment.codedeploy_role_policy_attachment: Creating...
aws_ecs_task_definition.task_def: Creating...
aws_lb_listener_rule.listener_rule: Creation complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:listener-rule/app/demo-alb/8a9eeb265d836dbe/02c783ce0a62a09c/0f44e4e049b82b36]
aws_iam_role_policy_attachment.codedeploy_role_policy_attachment: Creation complete after 0s [id=demo-fargate-app-codeDeployRole-20230118141108024400000001]
aws_ecs_task_definition.task_def: Creation complete after 0s [id=demo-fargate-app]
aws_ecs_service.service: Creating...
aws_iam_role_policy_attachment.ecs_task_execution_role_policy_attachment: Creation complete after 0s [id=demo-fargate-app-ecsTaskExecutionRole-20230118141108372200000003]
aws_ecs_service.service: Creation complete after 1s [id=arn:aws:ecs:us-east-1:369168831564:service/ecs-fargate/demo-fargate-app]
aws_codedeploy_deployment_group.app_deployment_group: Creating...
aws_codedeploy_deployment_group.app_deployment_group: Still creating... [10s elapsed]
aws_codedeploy_deployment_group.app_deployment_group: Creation complete after 16s [id=072605b5-a9bc-4931-9375-67b68fa35758]

Apply complete! Resources: 16 added, 0 changed, 0 destroyed.

```

</details>
